# Homebrew Bundle — declarative package management
# Usage: brew bundle install
# Reference: https://github.com/Homebrew/homebrew-bundle

# === Core Utilities ===
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "wget"
brew "openssh"

# === Shell & Prompt ===
brew "fish"
brew "starship"
brew "zoxide"

# === Editor & Development ===
brew "neovim"
brew "ripgrep"
brew "fzf"

# === Modern CLI Tools ===
brew "mise"
brew "bat"
brew "eza"
brew "fd"
brew "btop"
brew "lazygit"
brew "git-delta"
brew "tlrc"
brew "fastfetch"

# === Dev Tools & Build ===
brew "autoconf"
brew "cmake"
brew "openssl"
brew "readline"
brew "git"
brew "git-lfs"
brew "tree"
brew "gh"
brew "bun"
brew "typescript-language-server"
brew "pyright"
# opencode CLI: install manually via: curl -fsSL https://opencode.ai/install | bash

# === Erlang/Elixir Build Dependencies ===
# (Keep these for building erlang & elixir via kerl)
brew "wxwidgets"
brew "libxslt"
brew "fop"

# === Casks (GUI Applications) ===
cask "ghostty"
cask "google-cloud-sdk"

# === Fonts ===
cask "font-hack-nerd-font"
